{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "batch_input_shape": [null, null, 48], "input_dtype": "float32", "return_sequences": true, "go_backwards": false, "stateful": false, "unroll": false, "consume_less": "cpu", "input_dim": 48, "input_length": null, "output_dim": 12, "init": "glorot_uniform", "inner_init": "orthogonal", "forget_bias_init": "one", "activation": "sigmoid", "inner_activation": "hard_sigmoid", "W_regularizer": null, "U_regularizer": null, "b_regularizer": null, "dropout_W": 0.0, "dropout_U": 0.0}}, {"class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "return_sequences": true, "go_backwards": false, "stateful": false, "unroll": false, "consume_less": "cpu", "input_dim": 12, "input_length": null, "output_dim": 8, "init": "glorot_uniform", "inner_init": "orthogonal", "forget_bias_init": "one", "activation": "sigmoid", "inner_activation": "hard_sigmoid", "W_regularizer": null, "U_regularizer": null, "b_regularizer": null, "dropout_W": 0.0, "dropout_U": 0.0}}, {"class_name": "LSTM", "config": {"name": "lstm_3", "trainable": true, "return_sequences": true, "go_backwards": false, "stateful": false, "unroll": false, "consume_less": "cpu", "input_dim": 8, "input_length": null, "output_dim": 8, "init": "glorot_uniform", "inner_init": "orthogonal", "forget_bias_init": "one", "activation": "sigmoid", "inner_activation": "hard_sigmoid", "W_regularizer": null, "U_regularizer": null, "b_regularizer": null, "dropout_W": 0.0, "dropout_U": 0.0}}, {"class_name": "LSTM", "config": {"name": "lstm_4", "trainable": true, "return_sequences": false, "go_backwards": false, "stateful": false, "unroll": false, "consume_less": "cpu", "input_dim": 8, "input_length": null, "output_dim": 48, "init": "glorot_uniform", "inner_init": "orthogonal", "forget_bias_init": "one", "activation": "sigmoid", "inner_activation": "hard_sigmoid", "W_regularizer": null, "U_regularizer": null, "b_regularizer": null, "dropout_W": 0.0, "dropout_U": 0.0}}], "keras_version": "1.2.2"}